dwgan/STKNX_ChargeStation/source/drivers/AD/STM32G0XXX/include/Stm32G0xxx_adc.h
/********************************************************************
* Right reserved (C 2016) for *********** company.
*
* File Name        : Stm32G0xxx_adc.h
*
* File Description : Header file for stm32f10xx adc definition.
*
* Other Description: No.
*
* Version          : 1.00
*
* Author           : 
*
* Data             : 2016.7.28
*
* Modification Rec.:
*   Modify Data    : 2016.7.28
*   Operator       :
*   Version        : 1.00
*   Action         : Creation.
*
********************************************************************/


#ifndef _STM32G0XXX_ADC_H_
#define _STM32G0XXX_ADC_H_

#ifdef __cplusplus
extern "C" {
#endif

/* ADC parameter data field position definition   */
#define ADC_PARA_DEVTYPE_INDEX         0
#define ADC_PARA_DEV_NO_INDEX          1
#define ADC_PARA_CHNL_NO_INDEX         2
#define ADC_PARA_CMD_INDEX             3
#define ADC_PARA_CMD_PARA_INDEX        4
#define ADC_PARA_TRIGGER_INDEX         5
#define ADC_PARA_SAMPLE_CNT_INDEX      6

#define SYSCLK_FREQ_24M                24000000
#define SYSCLK_FREQ_32M                32000000
#define SYSCLK_FREQ_36M                36000000
#define SYSCLK_FREQ_48M                48000000
#define SYSCLK_FREQ_56M                56000000
#define SYSCLK_FREQ_72M                72000000

#define ADC_REGULAOR_TIME              21                                        /* 20us */
#define ADC_MAX_CHL_NUM                19                                        /* we define the total channel number of the ADC. */

#define ADC_TRG_POL_H                  1                                         /* positive edge for triggering. */
#define ADC_TRG_POL_L                  2                                         /* negtive edge for triggering.  */
#define ADC_TRG_POL_HL                 3                                         /* both triggering.              */

#define ADC_TIM1_TRGO2                 0                                         /* Hardware triger source 0      */
#define ADC_TIM1_CC4                   1                                         /* Hardware triger source 1      */
#define ADC_RESERVE1                   2                                         /* Hardware triger source 2      */
#define ADC_TIM3_TRGO                  3                                         /* Hardware triger source 3      */
#define ADC_TIM15_TRGO                 4                                         /* Hardware triger source 4      */
#define ADC_TIM6_TRGO                  5                                         /* Hardware triger source 5      */
#define ADC_RESERVE2                   6                                         /* Hardware triger source 6      */
#define ADC_EXTI_LINE                  7                                         /* Hardware triger source 7      */

#define ADC_OVERSMPLE_0                0                                         /* no oversample.   */
#define ADC_OVERSMPLE_2                1                                         /* 000: 2x   */
#define ADC_OVERSMPLE_4                2                                         /* 001: 4x   */
#define ADC_OVERSMPLE_8                3                                         /* 010: 8x   */
#define ADC_OVERSMPLE_16               4                                         /* 011: 16x  */
#define ADC_OVERSMPLE_32               5                                         /* 100: 32x  */
#define ADC_OVERSMPLE_64               6                                         /* 101: 64x  */
#define ADC_OVERSMPLE_128              7                                         /* 110: 128x */
#define ADC_OVERSMPLE_256              8                                         /* 111: 256x */

/******************************************************************************/
/*                                                                            */
/*                      Analog to Digital Converter (ADC)                     */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for ADC_ISR register  *******************/
#define ADC_ISR_ADRDY_MSK              (0x00000001UL)                            /* ADC ready flag */
#define ADC_ISR_EOSMP_MSK              (0x00000002UL)                            /* ADC group regular end of sampling flag */
#define ADC_ISR_EOC_MSK                (0x00000004UL)                            /* ADC group regular end of unitary conversion flag */
#define ADC_ISR_EOS_MSK                (0x00000008UL)                            /* ADC group regular end of sequence conversions flag */
#define ADC_ISR_OVR_MSK                (0x00000010UL)                            /* ADC group regular overrun flag */
#define ADC_ISR_AWD1_MSK               (0x00000080UL)                            /* ADC analog watchdog 1 flag */
#define ADC_ISR_AWD2_MSK               (0x00000100UL)                            /* ADC analog watchdog 2 flag */
#define ADC_ISR_AWD3_MSK               (0x00000200UL)                            /* ADC analog watchdog 3 flag */
#define ADC_ISR_EOCAL_MSK              (0x00000800UL)                            /* ADC end of calibration flag */
#define ADC_ISR_CCRDY_MSK              (0x00002000UL)                            /* ADC channel configuration ready flag */

/* Legacy defines */
#define ADC_ISR_EOSEQ           (ADC_ISR_EOS)

/********************  Bit definition for ADC_IER register  *******************/
#define ADC_IER_ADRDYIE_MSK            (0x00000001UL)                            /* ADC ready interrupt */
#define ADC_IER_EOSMPIE_MSK            (0x00000002UL)                            /* ADC group regular end of sampling interrupt */
#define ADC_IER_EOCIE_MSK              (0x00000004UL)                            /* ADC group regular end of unitary conversion interrupt */
#define ADC_IER_EOSIE_MSK              (0x00000008UL)                            /* ADC group regular end of sequence conversions interrupt */
#define ADC_IER_OVRIE_MSK              (0x00000010UL)                            /* ADC group regular overrun interrupt */
#define ADC_IER_AWD1IE_MSK             (0x00000080UL)                            /* ADC analog watchdog 1 interrupt */
#define ADC_IER_AWD2IE_MSK             (0x00000100UL)                            /* ADC analog watchdog 2 interrupt */
#define ADC_IER_AWD3IE_MSK             (0x00000200UL)                            /* ADC analog watchdog 3 interrupt */
#define ADC_IER_EOCALIE_MSK            (0x00000800UL)                            /* ADC end of calibration interrupt */
#define ADC_IER_CCRDYIE_MSK            (0x00002000UL)                            /* ADC channel configuration ready interrupt */

