dwgan/STKNX_ChargeStation/source/drivers/AD/STM32G0XXX/include/Stm32G0xxx_adc.h
/* Legacy defines */
#define ADC_IER_EOSEQIE           (ADC_IER_EOSIE)

/********************  Bit definition for ADC_CR register  ********************/
#define ADC_CR_ADEN_MSK                (0x00000001UL)                            /* ADC enable  */
#define ADC_CR_ADDIS_MSK               (0x00000002UL)                            /* ADC disable */
#define ADC_CR_ADSTART_MSK             (0x00000004UL)                            /* ADC start   */
#define ADC_CR_ADSTP_MSK               (0x00000010UL)                            /* ADC stop    */
#define ADC_CR_ADVREGEN_MSK            (0x10000000UL)                            /* ADC voltage regulator enable */
#define ADC_CR_ADCAL_MSK               (0x80000000UL)                            /* ADC calibration              */

/********************  Bit definition for ADC_CFGR1 register  *****************/
#define ADC_CFGR1_DMAEN_MSK            (0x00000001UL)                            /* ADC DMA transfer enable */
#define ADC_CFGR1_DMACFG_MSK           (0x00000002UL)                            /* ADC DMA transfer configuration */
#define ADC_CFGR1_SCANDIR_MSK          (0x00000004UL)                            /* ADC group regular sequencer scan direction */
#define ADC_CFGR1_RES_MSK              (0x00000018UL)                            /* ADC data resolution */
#define ADC_CFGR1_RES_0                (0x00000008UL)
#define ADC_CFGR1_RES_1                (0x00000010UL)
#define ADC_CFGR1_ALIGN_MSK            (0x00000020UL)                            /* ADC data alignement */

#define ADC_CFGR1_EXTSEL_SHIFT         6
#define ADC_CFGR1_EXTSEL_MSK           (0x000001C0UL)                            /* ADC group regular external trigger source */
#define ADC_CFGR1_EXTSEL_0             (0x00000040UL)
#define ADC_CFGR1_EXTSEL_1             (0x00000080UL)
#define ADC_CFGR1_EXTSEL_2             (0x00000100UL)

#define ADC_CFGR1_EXTEN_SHIFT          10
#define ADC_CFGR1_EXTEN_MSK            (0x00000C00UL)                            /* ADC group regular external trigger polarity */
#define ADC_CFGR1_EXTEN_0              (0x00000400UL)
#define ADC_CFGR1_EXTEN_1              (0x00000800UL)

#define ADC_CFGR1_OVRMOD_MSK           (0x00001000UL)                            /* ADC group regular overrun configuration */
#define ADC_CFGR1_CONT_MSK             (0x00002000UL)                            /* ADC group regular continuous conversion mode */
#define ADC_CFGR1_WAIT_MSK             (0x00004000UL)                            /* ADC low power auto wait */
#define ADC_CFGR1_AUTOFF_MSK           (0x00008000UL)                            /* ADC low power auto power off */
#define ADC_CFGR1_DISCEN_MSK           (0x00010000UL)                            /* ADC group regular sequencer discontinuous mode */
#define ADC_CFGR1_CHSELRMOD_MSK        (0x00200000UL)                            /* ADC group regular sequencer mode */
#define ADC_CFGR1_AWD1SGL_MSK          (0x00400000UL)                            /* ADC analog watchdog 1 monitoring a single channel or all channels */
#define ADC_CFGR1_AWD1EN_MSK           (0x00800000UL)                            /* ADC analog watchdog 1 enable on scope ADC group regular */

#define ADC_CFGR1_AWD1CH_MSK           (0x7C000000UL)                            /* ADC analog watchdog 1 monitored channel selection */
#define ADC_CFGR1_AWD1CH_0             (0x04000000UL)
#define ADC_CFGR1_AWD1CH_1             (0x08000000UL)
#define ADC_CFGR1_AWD1CH_2             (0x10000000UL)
#define ADC_CFGR1_AWD1CH_3             (0x20000000UL)
#define ADC_CFGR1_AWD1CH_4             (0x40000000UL)

/* Legacy defines */
#define ADC_CFGR1_AUTDLY          (ADC_CFGR1_WAIT)

/********************  Bit definition for ADC_CFGR2 register  *****************/
#define ADC_CFGR2_OVSR_SHIFT           2
#define ADC_CFGR2_OVSS_SHIFT           5
#define ADC_CFGR2_OVSE_MSK             (0x00000001UL)                            /* ADC oversampler enable on scope ADC group regular */
#define ADC_CFGR2_OVSR_MSK             (0x0000001CUL)                            /* ADC oversampling ratio */
#define ADC_CFGR2_OVSR_0               (0x00000004UL)
#define ADC_CFGR2_OVSR_1               (0x00000008UL)
#define ADC_CFGR2_OVSR_2               (0x00000010UL)
#define ADC_CFGR2_OVSS_MSK             (0x000001E0UL)                            /* ADC oversampling shift */
#define ADC_CFGR2_OVSS_0               (0x00000020UL)
#define ADC_CFGR2_OVSS_1               (0x00000040UL)
#define ADC_CFGR2_OVSS_2               (0x00000080UL)
#define ADC_CFGR2_OVSS_3               (0x00000100UL)
#define ADC_CFGR2_TOVS_MSK             (0x00000200UL)                            /* ADC oversampling discontinuous mode (triggered mode) for ADC group regular */
#define ADC_CFGR2_LFTRIG_MSK           (0x20000000UL)                            /* ADC low frequency trigger mode */
#define ADC_CFGR2_CKMODE_MSK           (0xC0000000UL)                            /* ADC clock source and prescaler (prescaler only for clock source synchronous) */
#define ADC_CFGR2_CKMODE_1             (0x80000000UL)
#define ADC_CFGR2_CKMODE_0             (0x40000000UL)

/********************  Bit definition for ADC_SMPR register  ******************/
#define ADC_SMPR_SMP1_MSK              (0x00000007UL)                            /* ADC group of channels sampling time 1 */
#define ADC_SMPR_SMP1_0                (0x00000001UL)
#define ADC_SMPR_SMP1_1                (0x00000002UL)
#define ADC_SMPR_SMP1_2                (0x00000004UL)

#define ADC_SMPR_SMP2_MSK              (0x00000070UL)                            /* ADC group of channels sampling time 2 */
#define ADC_SMPR_SMP2_0                (0x00000010UL)
#define ADC_SMPR_SMP2_1                (0x00000020UL)
#define ADC_SMPR_SMP2_2                (0x00000040UL)

#define ADC_SMPR_SMPSEL_MSK            (0x07FFFF00UL)                            /* ADC all channels sampling time selection */
#define ADC_SMPR_SMPSEL0_MSK           (0x00000100UL)                            /* ADC channel 0 sampling time selection */
#define ADC_SMPR_SMPSEL1_MSK           (0x00000200UL)                            /* ADC channel 1 sampling time selection */
#define ADC_SMPR_SMPSEL2_MSK           (0x00000400UL)                            /* ADC channel 2 sampling time selection */
#define ADC_SMPR_SMPSEL3_MSK           (0x00000800UL)                            /* ADC channel 3 sampling time selection */
#define ADC_SMPR_SMPSEL4_MSK           (0x00001000UL)                            /* ADC channel 4 sampling time selection */
#define ADC_SMPR_SMPSEL5_MSK           (0x00002000UL)                            /* ADC channel 5 sampling time selection */
#define ADC_SMPR_SMPSEL6_MSK           (0x00004000UL)                            /* ADC channel 6 sampling time selection */
#define ADC_SMPR_SMPSEL7_MSK           (0x00008000UL)                            /* ADC channel 7 sampling time selection */
#define ADC_SMPR_SMPSEL8_MSK           (0x00010000UL)                            /* ADC channel 8 sampling time selection */
#define ADC_SMPR_SMPSEL9_MSK           (0x00020000UL)                            /* ADC channel 9 sampling time selection */
#define ADC_SMPR_SMPSEL10_MSK          (0x00040000UL)                            /* ADC channel 10 sampling time selection */
#define ADC_SMPR_SMPSEL11_MSK          (0x00080000UL)                            /* ADC channel 11 sampling time selection */
#define ADC_SMPR_SMPSEL12_MSK          (0x00100000UL)                            /* ADC channel 12 sampling time selection */
#define ADC_SMPR_SMPSEL13_MSK          (0x00200000UL)                            /* ADC channel 13 sampling time selection */
#define ADC_SMPR_SMPSEL14_MSK          (0x00400000UL)                            /* ADC channel 14 sampling time selection */
#define ADC_SMPR_SMPSEL15_MSK          (0x00800000UL)                            /* ADC channel 15 sampling time selection */
#define ADC_SMPR_SMPSEL16_MSK          (0x01000000UL)                            /* ADC channel 16 sampling time selection */
#define ADC_SMPR_SMPSEL17_MSK          (0x02000000UL)                            /* ADC channel 17 sampling time selection */
#define ADC_SMPR_SMPSEL18_MSK          (0x04000000UL)                            /* ADC channel 18 sampling time selection */

/********************  Bit definition for ADC_TR1 register  *******************/
#define ADC_TR1_LT1_Pos                (0U)
#define ADC_TR1_LT1_MSK                (0xFFFUL << ADC_TR1_LT1_Pos)              /* 0x00000FFF */
#define ADC_TR1_LT1                    ADC_TR1_LT1_MSK                           /* ADC analog watchdog 1 threshold low */
#define ADC_TR1_LT1_0                  (0x001UL << ADC_TR1_LT1_Pos)              /* 0x00000001 */
#define ADC_TR1_LT1_1                  (0x002UL << ADC_TR1_LT1_Pos)              /* 0x00000002 */
#define ADC_TR1_LT1_2                  (0x004UL << ADC_TR1_LT1_Pos)              /* 0x00000004 */
#define ADC_TR1_LT1_3                  (0x008UL << ADC_TR1_LT1_Pos)              /* 0x00000008 */
#define ADC_TR1_LT1_4                  (0x010UL << ADC_TR1_LT1_Pos)              /* 0x00000010 */
#define ADC_TR1_LT1_5                  (0x020UL << ADC_TR1_LT1_Pos)              /* 0x00000020 */
#define ADC_TR1_LT1_6                  (0x040UL << ADC_TR1_LT1_Pos)              /* 0x00000040 */
#define ADC_TR1_LT1_7                  (0x080UL << ADC_TR1_LT1_Pos)              /* 0x00000080 */
#define ADC_TR1_LT1_8                  (0x100UL << ADC_TR1_LT1_Pos)              /* 0x00000100 */
#define ADC_TR1_LT1_9                  (0x200UL << ADC_TR1_LT1_Pos)              /* 0x00000200 */
#define ADC_TR1_LT1_10                 (0x400UL << ADC_TR1_LT1_Pos)              /* 0x00000400 */
#define ADC_TR1_LT1_11                 (0x800UL << ADC_TR1_LT1_Pos)              /* 0x00000800 */

#define ADC_TR1_HT1_Pos                (16U)
#define ADC_TR1_HT1_MSK                (0xFFFUL << ADC_TR1_HT1_Pos)              /* 0x0FFF0000 */
#define ADC_TR1_HT1                    ADC_TR1_HT1_MSK                           /* ADC Analog watchdog 1 threshold high */
#define ADC_TR1_HT1_0                  (0x001UL << ADC_TR1_HT1_Pos)              /* 0x00010000 */
#define ADC_TR1_HT1_1                  (0x002UL << ADC_TR1_HT1_Pos)              /* 0x00020000 */
#define ADC_TR1_HT1_2                  (0x004UL << ADC_TR1_HT1_Pos)              /* 0x00040000 */
#define ADC_TR1_HT1_3                  (0x008UL << ADC_TR1_HT1_Pos)              /* 0x00080000 */
#define ADC_TR1_HT1_4                  (0x010UL << ADC_TR1_HT1_Pos)              /* 0x00100000 */
#define ADC_TR1_HT1_5                  (0x020UL << ADC_TR1_HT1_Pos)              /* 0x00200000 */
#define ADC_TR1_HT1_6                  (0x040UL << ADC_TR1_HT1_Pos)              /* 0x00400000 */
#define ADC_TR1_HT1_7                  (0x080UL << ADC_TR1_HT1_Pos)              /* 0x00800000 */
#define ADC_TR1_HT1_8                  (0x100UL << ADC_TR1_HT1_Pos)              /* 0x01000000 */
#define ADC_TR1_HT1_9                  (0x200UL << ADC_TR1_HT1_Pos)              /* 0x02000000 */
#define ADC_TR1_HT1_10                 (0x400UL << ADC_TR1_HT1_Pos)              /* 0x04000000 */
#define ADC_TR1_HT1_11                 (0x800UL << ADC_TR1_HT1_Pos)              /* 0x08000000 */

