dwgan/STKNX_ChargeStation/source/drivers/AD/STM32G0XXX/include/Stm32G0xxx_adc.h
#define ADC_CHSELR_SQ7_MSK             (0x0F000000UL)                            /* ADC group regular sequencer rank 7, available when ADC_CFGR1_CHSELRMOD is set */
#define ADC_CHSELR_SQ7_0               (0x01000000UL)
#define ADC_CHSELR_SQ7_1               (0x02000000UL)
#define ADC_CHSELR_SQ7_2               (0x04000000UL)
#define ADC_CHSELR_SQ7_3               (0x08000000UL)

#define ADC_CHSELR_SQ6_MSK             (0x00F00000UL)                            /* ADC group regular sequencer rank 6, available when ADC_CFGR1_CHSELRMOD is set */
#define ADC_CHSELR_SQ6_0               (0x00100000UL)
#define ADC_CHSELR_SQ6_1               (0x00200000UL)
#define ADC_CHSELR_SQ6_2               (0x00400000UL)
#define ADC_CHSELR_SQ6_3               (0x00800000UL)

#define ADC_CHSELR_SQ5_MSK             (0x000F0000UL)                            /* ADC group regular sequencer rank 5, available when ADC_CFGR1_CHSELRMOD is set */
#define ADC_CHSELR_SQ5_0               (0x00010000UL)
#define ADC_CHSELR_SQ5_1               (0x00020000UL)
#define ADC_CHSELR_SQ5_2               (0x00040000UL)
#define ADC_CHSELR_SQ5_3               (0x00080000UL)

#define ADC_CHSELR_SQ4_MSK             (0x0000F000UL)                            /* ADC group regular sequencer rank 4, available when ADC_CFGR1_CHSELRMOD is set */
#define ADC_CHSELR_SQ4_0               (0x00001000UL)
#define ADC_CHSELR_SQ4_1               (0x00002000UL)
#define ADC_CHSELR_SQ4_2               (0x00004000UL)
#define ADC_CHSELR_SQ4_3               (0x00008000UL)

#define ADC_CHSELR_SQ3_MSK             (0x00000F00UL)                            /* ADC group regular sequencer rank 3, available when ADC_CFGR1_CHSELRMOD is set */
#define ADC_CHSELR_SQ3_0               (0x00000100UL)
#define ADC_CHSELR_SQ3_1               (0x00000200UL)
#define ADC_CHSELR_SQ3_2               (0x00000400UL)
#define ADC_CHSELR_SQ3_3               (0x00000800UL)

#define ADC_CHSELR_SQ2_MSK             (0x000000F0UL)                            /* ADC group regular sequencer rank 2, available when ADC_CFGR1_CHSELRMOD is set */
#define ADC_CHSELR_SQ2_0               (0x00000010UL)
#define ADC_CHSELR_SQ2_1               (0x00000020UL)
#define ADC_CHSELR_SQ2_2               (0x00000040UL)
#define ADC_CHSELR_SQ2_3               (0x00000080UL)

#define ADC_CHSELR_SQ1_MSK             (0x0000000FUL)                            /* ADC group regular sequencer rank 1, available when ADC_CFGR1_CHSELRMOD is set */
#define ADC_CHSELR_SQ1_0               (0x00000001UL)
#define ADC_CHSELR_SQ1_1               (0x00000002UL)
#define ADC_CHSELR_SQ1_2               (0x00000004UL)
#define ADC_CHSELR_SQ1_3               (0x00000008UL)

/********************  Bit definition for ADC_TR3 register  *******************/
#define ADC_TR3_LT3_Pos                (0U)
#define ADC_TR3_LT3_MSK                (0xFFFUL << ADC_TR3_LT3_Pos)            /* 0x00000FFF */
#define ADC_TR3_LT3                    ADC_TR3_LT3_MSK                         /* ADC analog watchdog 3 threshold low */
#define ADC_TR3_LT3_0                  (0x001UL << ADC_TR3_LT3_Pos)            /* 0x00000001 */
#define ADC_TR3_LT3_1                  (0x002UL << ADC_TR3_LT3_Pos)            /* 0x00000002 */
#define ADC_TR3_LT3_2                  (0x004UL << ADC_TR3_LT3_Pos)            /* 0x00000004 */
#define ADC_TR3_LT3_3                  (0x008UL << ADC_TR3_LT3_Pos)            /* 0x00000008 */
#define ADC_TR3_LT3_4                  (0x010UL << ADC_TR3_LT3_Pos)            /* 0x00000010 */
#define ADC_TR3_LT3_5                  (0x020UL << ADC_TR3_LT3_Pos)            /* 0x00000020 */
#define ADC_TR3_LT3_6                  (0x040UL << ADC_TR3_LT3_Pos)            /* 0x00000040 */
#define ADC_TR3_LT3_7                  (0x080UL << ADC_TR3_LT3_Pos)            /* 0x00000080 */
#define ADC_TR3_LT3_8                  (0x100UL << ADC_TR3_LT3_Pos)            /* 0x00000100 */
#define ADC_TR3_LT3_9                  (0x200UL << ADC_TR3_LT3_Pos)            /* 0x00000200 */
#define ADC_TR3_LT3_10                 (0x400UL << ADC_TR3_LT3_Pos)            /* 0x00000400 */
#define ADC_TR3_LT3_11                 (0x800UL << ADC_TR3_LT3_Pos)            /* 0x00000800 */

#define ADC_TR3_HT3_Pos                (16U)
#define ADC_TR3_HT3_MSK                (0xFFFUL << ADC_TR3_HT3_Pos)            /* 0x0FFF0000 */
#define ADC_TR3_HT3                    ADC_TR3_HT3_MSK                         /* ADC analog watchdog 3 threshold high */
#define ADC_TR3_HT3_0                  (0x001UL << ADC_TR3_HT3_Pos)            /* 0x00010000 */
#define ADC_TR3_HT3_1                  (0x002UL << ADC_TR3_HT3_Pos)            /* 0x00020000 */
#define ADC_TR3_HT3_2                  (0x004UL << ADC_TR3_HT3_Pos)            /* 0x00040000 */
#define ADC_TR3_HT3_3                  (0x008UL << ADC_TR3_HT3_Pos)            /* 0x00080000 */
#define ADC_TR3_HT3_4                  (0x010UL << ADC_TR3_HT3_Pos)            /* 0x00100000 */
#define ADC_TR3_HT3_5                  (0x020UL << ADC_TR3_HT3_Pos)            /* 0x00200000 */
#define ADC_TR3_HT3_6                  (0x040UL << ADC_TR3_HT3_Pos)            /* 0x00400000 */
#define ADC_TR3_HT3_7                  (0x080UL << ADC_TR3_HT3_Pos)            /* 0x00800000 */
#define ADC_TR3_HT3_8                  (0x100UL << ADC_TR3_HT3_Pos)            /* 0x01000000 */
#define ADC_TR3_HT3_9                  (0x200UL << ADC_TR3_HT3_Pos)            /* 0x02000000 */
#define ADC_TR3_HT3_10                 (0x400UL << ADC_TR3_HT3_Pos)            /* 0x04000000 */
#define ADC_TR3_HT3_11                 (0x800UL << ADC_TR3_HT3_Pos)            /* 0x08000000 */

/********************  Bit definition for ADC_DR register  ********************/
#define ADC_DR_DATA_MSK                (0x0000FFFFUL)                          /* ADC group regular conversion data */
#define ADC_DR_DATA_0                  (0x00000001UL)
#define ADC_DR_DATA_1                  (0x00000002UL)
#define ADC_DR_DATA_2                  (0x00000004UL)
#define ADC_DR_DATA_3                  (0x00000008UL)
#define ADC_DR_DATA_4                  (0x00000010UL)
#define ADC_DR_DATA_5                  (0x00000020UL)
#define ADC_DR_DATA_6                  (0x00000040UL)
#define ADC_DR_DATA_7                  (0x00000080UL)
#define ADC_DR_DATA_8                  (0x00000100UL)
#define ADC_DR_DATA_9                  (0x00000200UL)
#define ADC_DR_DATA_10                 (0x00000400UL)
#define ADC_DR_DATA_11                 (0x00000800UL)
#define ADC_DR_DATA_12                 (0x00001000UL)
#define ADC_DR_DATA_13                 (0x00002000UL)
#define ADC_DR_DATA_14                 (0x00004000UL)
#define ADC_DR_DATA_15                 (0x00008000UL)

/********************  Bit definition for ADC_AWD2CR register  ****************/
#define ADC_AWD2CR_AWD2CH_Pos          (0U)
#define ADC_AWD2CR_AWD2CH_MSK          (0x0007FFFF)                              /* ADC analog watchdog 2 monitored channel selection */
#define ADC_AWD2CR_AWD2CH_0            (0x00000001)                              /* 0x00000001 */
#define ADC_AWD2CR_AWD2CH_1            (0x00000002)                              /* 0x00000002 */
#define ADC_AWD2CR_AWD2CH_2            (0x00000004)                              /* 0x00000004 */
#define ADC_AWD2CR_AWD2CH_3            (0x00000008)                              /* 0x00000008 */
#define ADC_AWD2CR_AWD2CH_4            (0x00000010)                              /* 0x00000010 */
#define ADC_AWD2CR_AWD2CH_5            (0x00000020)                              /* 0x00000020 */
#define ADC_AWD2CR_AWD2CH_6            (0x00000040)                              /* 0x00000040 */
#define ADC_AWD2CR_AWD2CH_7            (0x00000080)                              /* 0x00000080 */
#define ADC_AWD2CR_AWD2CH_8            (0x00000100)                              /* 0x00000100 */
#define ADC_AWD2CR_AWD2CH_9            (0x00000200)                              /* 0x00000200 */
#define ADC_AWD2CR_AWD2CH_10           (0x00000400)                              /* 0x00000400 */
#define ADC_AWD2CR_AWD2CH_11           (0x00000800)                              /* 0x00000800 */
#define ADC_AWD2CR_AWD2CH_12           (0x00001000)                              /* 0x00001000 */
#define ADC_AWD2CR_AWD2CH_13           (0x00002000)                              /* 0x00002000 */
#define ADC_AWD2CR_AWD2CH_14           (0x00004000)                              /* 0x00004000 */
#define ADC_AWD2CR_AWD2CH_15           (0x00008000)                              /* 0x00008000 */
#define ADC_AWD2CR_AWD2CH_16           (0x00010000)                              /* 0x00010000 */
#define ADC_AWD2CR_AWD2CH_17           (0x00020000)                              /* 0x00020000 */
#define ADC_AWD2CR_AWD2CH_18           (0x00040000)                              /* 0x00040000 */

/********************  Bit definition for ADC_AWD3CR register  ****************/
#define ADC_AWD3CR_AWD3CH_Pos          (0U)
#define ADC_AWD3CR_AWD3CH_MSK          (0x7FFFFUL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x0007FFFF */
#define ADC_AWD3CR_AWD3CH              ADC_AWD3CR_AWD3CH_MSK                   /* ADC analog watchdog 3 monitored channel selection */
#define ADC_AWD3CR_AWD3CH_0            (0x00001UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000001 */
#define ADC_AWD3CR_AWD3CH_1            (0x00002UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000002 */
#define ADC_AWD3CR_AWD3CH_2            (0x00004UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000004 */
#define ADC_AWD3CR_AWD3CH_3            (0x00008UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000008 */
#define ADC_AWD3CR_AWD3CH_4            (0x00010UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000010 */
#define ADC_AWD3CR_AWD3CH_5            (0x00020UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000020 */
#define ADC_AWD3CR_AWD3CH_6            (0x00040UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000040 */
#define ADC_AWD3CR_AWD3CH_7            (0x00080UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000080 */
#define ADC_AWD3CR_AWD3CH_8            (0x00100UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000100 */
#define ADC_AWD3CR_AWD3CH_9            (0x00200UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000200 */
#define ADC_AWD3CR_AWD3CH_10           (0x00400UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000400 */
#define ADC_AWD3CR_AWD3CH_11           (0x00800UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00000800 */
#define ADC_AWD3CR_AWD3CH_12           (0x01000UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00001000 */
#define ADC_AWD3CR_AWD3CH_13           (0x02000UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00002000 */
#define ADC_AWD3CR_AWD3CH_14           (0x04000UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00004000 */
#define ADC_AWD3CR_AWD3CH_15           (0x08000UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00008000 */
#define ADC_AWD3CR_AWD3CH_16           (0x10000UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00010000 */
#define ADC_AWD3CR_AWD3CH_17           (0x20000UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00020000 */
#define ADC_AWD3CR_AWD3CH_18           (0x40000UL << ADC_AWD3CR_AWD3CH_Pos)    /* 0x00040000 */

/********************  Bit definition for ADC_CALFACT register  ***************/
#define ADC_CALFACT_CALFACT_MSK        (0x0000007F)                            /* ADC calibration factor in single-ended mode */
#define ADC_CALFACT_CALFACT_0          (0x00000001UL)
#define ADC_CALFACT_CALFACT_1          (0x00000002UL)
#define ADC_CALFACT_CALFACT_2          (0x00000004UL)
#define ADC_CALFACT_CALFACT_3          (0x00000008UL)
#define ADC_CALFACT_CALFACT_4          (0x00000010UL)
#define ADC_CALFACT_CALFACT_5          (0x00000020UL)
#define ADC_CALFACT_CALFACT_6          (0x00000040UL)

/*************************  ADC Common registers  *****************************/
/********************  Bit definition for ADC_CCR register  *******************/
#define ADC_CCR_PRESC_MSK              (0x003C0000)                            /* ADC common clock prescaler, only for clock source asynchronous */
#define ADC_CCR_PRESC_DIV2             (0x00040000UL)
#define ADC_CCR_PRESC_DIV4             (0x00080000UL)
#define ADC_CCR_PRESC_DIV6             (0x000c0000UL)
#define ADC_CCR_PRESC_DIV8             (0x00100000UL)
#define ADC_CCR_PRESC_DIV10            (0x00140000UL)
#define ADC_CCR_PRESC_DIV12            (0x00180000UL)
#define ADC_CCR_PRESC_DIV16            (0x001c0000UL)
#define ADC_CCR_PRESC_DIV32            (0x00200000UL)
#define ADC_CCR_PRESC_DIV64            (0x00240000UL)
#define ADC_CCR_PRESC_DIV128           (0x00280000UL)
#define ADC_CCR_PRESC_DIV256           (0x002c0000UL)


#define ADC_CCR_VREFEN_MSK             (0x00400000)                              /* ADC internal path to VrefInt enable */
#define ADC_CCR_TSEN_MSK               (0x00800000)                              /* ADC internal path to temperature sensor enable */
#define ADC_CCR_VBATEN_MSK             (0x01000000)                              /* ADC internal path to battery voltage enable */

/* Legacy */
#define ADC_CCR_LFMEN_MSK              (0x02000000)                              /* Legacy feature, useless on STM32G0 (ADC common clock low frequency mode is automatically managed by ADC peripheral on STM32G0) */


/* Data structure definition */
/****************************************************
*   Structure£º  T_ADC_MEM_MAP
*   Description£ºMemory map of ADC registers.
*   Parameter:   
*   Authour£º    Ian
*   Modify record:
*   Date:  2016-7-31 creat.
****************************************************/
typedef struct _T_ADC_MEM_MAP
{
    WORD32 ISR;          /* ADC interrupt and status register,             Address offset: 0x00 */
    WORD32 IER;          /* ADC interrupt enable register,                 Address offset: 0x04 */
    WORD32 CR;           /* ADC control register,                          Address offset: 0x08 */
    WORD32 CFGR1;        /* ADC configuration register 1,                  Address offset: 0x0C */
    WORD32 CFGR2;        /* ADC configuration register 2,                  Address offset: 0x10 */
    WORD32 SMPR;         /* ADC sampling time register,                    Address offset: 0x14 */
    WORD32 RESERVED1;    /* Reserved,                                                      0x18 */
    WORD32 RESERVED2;    /* Reserved,                                                      0x1C */
    WORD32 TR1;          /* ADC analog watchdog 1 threshold register,      Address offset: 0x20 */
    WORD32 TR2;          /* ADC analog watchdog 2 threshold register,      Address offset: 0x24 */
    WORD32 CHSELR;       /* ADC group regular sequencer register,          Address offset: 0x28 */
    WORD32 TR3;          /* ADC analog watchdog 3 threshold register,      Address offset: 0x2C */
    WORD32 RESERVED3[4]; /* Reserved,                                               0x30 - 0x3C */
    WORD32 DR;           /* ADC group regular data register,               Address offset: 0x40 */
    WORD32 RESERVED4[23];/* Reserved,                                               0x44 - 0x9C */
    WORD32 AWD2CR;       /* ADC analog watchdog 2 configuration register,  Address offset: 0xA0 */
    WORD32 AWD3CR;       /* ADC analog watchdog 3 configuration register,  Address offset: 0xA4 */
    WORD32 RESERVED5[3]; /* Reserved,                                               0xA8 - 0xB0 */
    WORD32 CALFACT;      /* ADC Calibration factor register,               Address offset: 0xB4 */
}volatile *T_ADC_MEM_MAP;

#define ADC_ISR         (ADC1->ISR)
#define ADC_IER         (ADC1->IER)
#define ADC_CR          (ADC1->CR)
#define ADC_CFGR1       (ADC1->CFGR1)
#define ADC_CFGR2       (ADC1->CFGR2)
#define ADC_SMPR        (ADC1->SMPR)
#define ADC_TR1         (ADC1->TR1)
#define ADC_TR2         (ADC1->TR2)
#define ADC_CHSELR      (ADC1->CHSELR)
#define ADC_TR3         (ADC1->TR3)
#define ADC_DR          (ADC1->DR)
#define ADC_AWD2CR      (ADC1->AWD2CR)
#define ADC_AWD3CR      (ADC1->AWD3CR)
#define ADC_CALFACT     (ADC1->CALFACT)
#define ADC_CCR         *(WORD32*)(ADC1_BASE + 0x308)

/* timer handler for flash operation. */
typedef struct
{
    WORD32 (*pfGetMs)(VOID);            /* the handler for getting ms-time. */
    WORD32 (*pfGetDlyMs)(WORD32);       /* the handler for getting ms-delay base an old ms-time. */
}T_ADC_TMOPER;

/* Declaration of functions */
/**************************************************************************
* Funciton: void ADC_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara)
* Descrip.: Register ADC
* Input   : BYTE ucLogNo      Device logic No.
*           BYTE ucDevNo      Device physical No.
*           VOID *ptPara      None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/31       V1.0         Ian          Create 
**************************************************************************/
void ADC_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara);

