dwgan/STKNX_ChargeStation/source/drivers/AD/STM32G0XXX/include/Stm32G0xxx_adc.h
/*****************************************************************************************************************************************
* Function: WORD32 ADCx_Ctrl(T_SW_DEVICEDRIVER_PARA *ptPara)
* Descrip.: Control and configuration of ADC
* Input   : T_SW_DEVICEDRIVER_PARA *ptPara
*              ucPara[0]      BYTE      SW_PERIPHERAL_AD         Device type.              ADC_PARA_DEVTYPE_INDEX
*              ucPara[1]      BYTE      0                        Device physical number.   ADC_PARA_DEV_NO_INDEX
*              ucPara[2]      BYTE      0                        Channel physical number.  ADC_PARA_CHNL_NO_INDEX
*              ucPara[3]      BYTE      control command.         adc control command.      ADC_PARA_CMD_INDEX
*                                          SW_ADC_SOFT_STOP
*                                          SW_ADC_SOFT_START
*                                          SW_ADC_CONFIGURE
*              ucPara[4]      BYTE      command parameter.                                 ADC_PARA_CMD_PARA_INDEX
*                                          if ucPara[3] == SW_ADC_CONFIGURE then
*                                             ucPara[4] =  configure data;
*
*                                             if SW_ADC_LOWEST_SPEED then
*                                                sampling is in the lowest speed.
*                                             elif SW_ADC_MIDDLE_SPEED then
*                                                sampling is in the middle speed.
*                                             elif SW_ADC_HIGHEST_SPPED then
*                                                sampling is in the highest speed.
*                                             endif
*
*                                             if SW_ADC_LOWPW_EN then
*                                                nothing.
*                                             endif
*
*                                             if SW_ADC_TRIGGER_HARDWARE then
*                                                ucPara[5].bit0-bit2 device's hardware trigger number.   ADC_PARA_TRIGGER_INDEX
*                                                        ADC_TIM1_TRGO2
*                                                        ADC_TIM1_CC4  
*                                                        ADC_RESERVE1  
*                                                        ADC_TIM3_TRGO 
*                                                        ADC_TIM15_TRGO
*                                                        ADC_TIM6_TRGO 
*                                                        ADC_RESERVE2  
*                                                        ADC_EXTI_LINE 
*                                                ucPara[5].bit3-bit4 trigger polarity setting in hardware trigger mode.
*                                                        ADC_TRG_POL_H
*                                                        ADC_TRG_POL_L
*                                                        ADC_TRG_POL_HL
*                                             elif SW_ADC_TRIGGER_SOFT then
*                                                 conversion is triggered by software.
*                                             endif
*
*                                             if SW_ADC_SINGLE_CHL then
*                                                 one trigger one time sampling on the next one channel.
*                                             elif SW_ADC_GROUP_CHL then
*                                                 nothing.
*                                             elif SW_ADC_BURST_CHL then
*                                                 nothing.
*                                             endif
*
*                                             if SW_ADC_INT_EN then
*                                                 use interrupt to handle ADC,else not.
*                                             endif
*
*                                             if SW_ADC_DMA_EN then
*                                                 use DMA to handle ADC,else not. in this mode, only BUST mode is used.
*                                                 we shold enable ADC's interrupt and disable ADC interrupt in NVIC.
*                                             endif
*                                             
*                                             ucPara[6] =  sample number;         ADC_PARA_SAMPLE_CNT_INDEX
*                                                 if 0== ucPara[6] then ADC does not need to oversample.
*                                                 else ADC oversamples. ucPara[6] =  ADC_OVERSMPLE_0
*                                                                                    ADC_OVERSMPLE_2  
*                                                                                    ADC_OVERSMPLE_4  
*                                                                                    ADC_OVERSMPLE_8  
*                                                                                    ADC_OVERSMPLE_16 
*                                                                                    ADC_OVERSMPLE_32 
*                                                                                    ADC_OVERSMPLE_64 
*                                                                                    ADC_OVERSMPLE_128
*                                                                                    ADC_OVERSMPLE_256
*                                             pdwPara[0] : channel shoose.
*                                               pdwPara[0].bit0~bit18 <--> phy. channel 0  ~ phy. channel 18
*                                                          bit x = 1   --> phy. channel x is used. 
*                                               it is NOT logical channel. it means a physical channel is used.
*                                          endif
*
*                                          if ucPara[3] == SW_ADC_SOFT_START / SW_ADC_SOFT_STOP then
*                                             ucPara[2] =  channel number. Attention : it's a physical channel number beginning from 0.
*                                          endif
* Output  : no.
* Return  : SW_OK    Successful
*           SW_ERR   Failed
* Note    £ºNone
* Date             Version     Author        Content
* ---------------------------------------------------------------------------------------------------------------------------------------
* 2016/07/31       V1.0         Ian          Create 
*****************************************************************************************************************************************/
WORD32 ADCx_Ctrl(T_SW_DEVICEDRIVER_PARA *ptPara);

