dwgan/STKNX_ChargeStation/source/drivers/AD/STM32G0XXX/include/Stm32G0xxx_adc.h
/*****************************************************************************************************************
* Funciton: void Adcx_isr(void)
* Descrip.: interrupt process function of adc. used for sequence handling. it can not be used with software trigger
*           at the same time.
* Input   : no.
* Output  : no.
* Return  : no.
* Note    : This ISR will call the application callback function.the description of callback function's parameter
*           is as below:
*           T_SW_INT_EVENT  tReason
*             ucAppType        :   SW_MATH_INTERFACE.
*             ucDevId          :   SW_PERIPHERAL_AD
*             ucDevNo          :   device's physical No.
*             ucEvent          :   INTERRUPT_EVENT_RX
*                                        ucBuffer[0] is the physical channel No. begin with 0.
*                                        ucBuffer[1] is the low 8 bits of sampling data.
*                                        ucBuffer[2] is the up 4 bits of sampling data.
* Date             Version     Author        Content
* ---------------------------------------------------------------------------------------------------------------
* 2018/06/06        V1.0      Danny.cao      creation
*****************************************************************************************************************/
void Adcx_isr(void);

/*****************************************************************************************************************
* Funciton: WORD32 ADCx_Read(T_DATA_OPERARTION  *ptData)
* Descrip.: Get data from ADC data register
* Input   : None.
* Output  : T_DATA_OPERARTION  *ptData: 
*              ucDevNo       0              Device No.
*              pucBuffer     0~255          Low 8-bit of ADC data
*              pucBuffer+1   0~255          High 8-bit of ADC data
*              wDataLength   0~65535        The length of ADC data
* Return  : SW_OK    Successful
            SW_ERR   Failed
* Note    : None
* Date             Version     Author        Content
* ----------------------------------------------------------------------------------------------------------------
* 2016/07/31       V1.0       Danny.cao      Create 
*****************************************************************************************************************/
WORD32 ADCx_Read(T_DATA_OPERARTION  *ptData);

#ifdef __cplusplus
}
#endif

#endif /* _STM32G0XXX_ADC_H_ */



